SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ, Н_ВЕДОМОСТИ.ИД
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ 
RIGHT JOIN Н_ВЕДОМОСТИ ON Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ВЕД_ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ = 'Ведомость' AND Н_ВЕДОМОСТИ.ИД = 39921;



SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.ИД
FROM Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
LEFT JOIN Н_СЕССИЯ ON Н_ВЕДОМОСТИ.СЭС_ИД = Н_СЕССИЯ.ИД
WHERE Н_ЛЮДИ.ИМЯ > 'Николай' AND Н_ВЕДОМОСТИ.ЧЛВК_ИД < 117219 AND Н_СЕССИЯ.ДАТА > '2002-01-04';



SELECT COUNT(DISTINCT Н_ЛЮДИ.ИД)
FROM Н_ЛЮДИ
JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД 
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Вечерняя' AND Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ > CURRENT_DATE - INTERVAL '20 years';



SELECT Н_ПЛАНЫ.ИД AS ПЛАН_ИД
FROM Н_ПЛАНЫ
JOIN Н_ГРУППЫ_ПЛАНОВ ON Н_ПЛАНЫ.ИД = Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД_ЗАКРЕПЛЕН_ЗА = Н_ОТДЕЛЫ.ИД
WHERE Н_ОТДЕЛЫ.ИМЯ_В_ИМИН_ПАДЕЖЕ = 'Кафедра вычислительной техники'
GROUP BY Н_ПЛАНЫ.ИД
HAVING COUNT(Н_ГРУППЫ_ПЛАНОВ.ГРУППА) = 2;


SELECT Н_ЛЮДИ.ИД AS Номер,
       (Н_ЛЮДИ.ФАМИЛИЯ || ' ' || Н_ЛЮДИ.ИМЯ || ' ' || Н_ЛЮДИ.ОТЧЕСТВО) AS ФИО,
       AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::NUMERIC) AS Ср_оценка
FROM Н_ЛЮДИ
JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE Н_УЧЕНИКИ.ГРУППА = '4100'
  AND Н_ВЕДОМОСТИ.ОЦЕНКА IS NOT NULL
  AND Н_ВЕДОМОСТИ.ОЦЕНКА ~ '^\d+$'  -- только цифры
GROUP BY Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО
HAVING AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::NUMERIC) >= (
    SELECT MAX(Н_ВЕДОМОСТИ.ОЦЕНКА::NUMERIC)
    FROM Н_ВЕДОМОСТИ
    JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    WHERE Н_УЧЕНИКИ.ГРУППА = '1101'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА IS NOT NULL
      AND Н_ВЕДОМОСТИ.ОЦЕНКА ~ '^\d+$'




SELECT
    Н_УЧЕНИКИ.ГРУППА,
    Н_ЛЮДИ.ИД AS Номер_студента,
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО,
    Н_УЧЕНИКИ.П_ПРКОК_ИД AS Номер_пункта_приказа
FROM
    Н_ЛЮДИ
JOIN
    Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN
    Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN
    Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
JOIN
    Н_НАПР_СПЕЦ ON Н_ПЛАНЫ.НАПС_ИД = Н_НАПР_СПЕЦ.ИД
WHERE
    Н_УЧЕНИКИ.СОСТОЯНИЕ = 'Отчислен'
    AND Н_УЧЕНИКИ.КОНЕЦ > '2012-09-01'
    AND Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная'
    AND Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101';



SELECT
    COUNT(*)
FROM (
    SELECT
        Н_УЧЕНИКИ.ЧЛВК_ИД
    FROM
        Н_УЧЕНИКИ
    JOIN
        Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
    WHERE
        Н_УЧЕНИКИ.ГРУППА = '3100'  
        AND Н_ВЕДОМОСТИ.ОЦЕНКА IS NOT NULL
        AND Н_ВЕДОМОСТИ.ОЦЕНКА ~ '^\d+$' 
    GROUP BY
        Н_УЧЕНИКИ.ЧЛВК_ИД
    HAVING
        AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::NUMERIC) = 3
) AS Troechniki;




SELECT
        COUNT(DISTINCT Н_УЧЕНИКИ.ЧЛВК_ИД)
    FROM
        Н_УЧЕНИКИ
    JOIN
        Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
    WHERE
        Н_УЧЕНИКИ.ГРУППА = '3100'
        AND Н_ВЕДОМОСТИ.ОЦЕНКА IS NOT NULL
        AND Н_ВЕДОМОСТИ.ОЦЕНКА ~ '^\d+$'
AND Н_ВЕДОМОСТИ.ОЦЕНКА = '3';
